<template>
  <hr />
  <h4>{{ title }}</h4>
  <ul>
    <li v-for="item in news">{{item.title}} <span v-if="item.wasRead">!!!</span></li>
  </ul>
</template>

<script>
export default {

  /* 
  Чтобы внедрить данные, предоставленные компонентом-предком, используйте inject 

  Обычно данные из родительского компонента в дочерний передаются с помощью входных параметров. 
  Но представьте структуру, где есть несколько вложенных компонентов и требуется передать что-то из родительского компонента 
  в глубоко вложенный дочерний. Придётся передавать входные параметры вниз по всей цепочке компонентов, что иногда может быть очень неудобно.

  В таких случаях можно использовать пару provide и inject. 
  Родительские компоненты могут служить провайдерами зависимостей для всех своих потомков, 

  независимо от того, насколько глубокая иерархия компонентов. Работа этой возможности состоит из двух частей: 
  родительский компонент имеет опцию provide для предоставления данных, 
  а дочерний компонент имеет опцию inject для внедрения и использования этих данных.

  */
  inject: ['title', 'news']
}
</script>

<style scoped>

</style>